<!doctype html>
<html class="theme-next use-motion theme-next-mist">
<head>
  

<meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>


<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






  <link rel="stylesheet" type="text/css" href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5"/>




<link rel="stylesheet" type="text/css" href="/css/main.css?v=0.4.5.1"/>


    <meta name="description" content="工作以来的尝试和感想" />



  <meta name="keywords" content="Rambo,blog" />





  <link rel="shorticon icon" type="image/x-icon" href="/favicon.ico?v=0.4.5.1" />


<meta name="description" content="2016年还剩不到一个小时，静静回顾下这一年～">
<meta property="og:type" content="article">
<meta property="og:title" content="2016">
<meta property="og:url" content="http://rambone.me/2016/12/31/2016/index.html">
<meta property="og:site_name" content="Web开发实践手札">
<meta property="og:description" content="2016年还剩不到一个小时，静静回顾下这一年～">
<meta property="og:image" content="http://rambone.me/2016/12/31/2016/images/2016gitlab.png">
<meta property="og:updated_time" content="2016-12-31T17:45:11.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2016">
<meta name="twitter:description" content="2016年还剩不到一个小时，静静回顾下这一年～">


<script type="text/javascript" id="hexo.configuration">
  var CONFIG = {
    scheme: 'Mist',
    sidebar: 'post'
  };
</script>

  <title> 2016 | Web开发实践手札 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  <!--[if lte IE 8]>
  <div style=' clear: both; height: 59px; padding:0 0 0 15px; position: relative;margin:0 auto;'>
    <a href="http://windows.microsoft.com/en-US/internet-explorer/products/ie/home?ocid=ie6_countdown_bannercode">
      <img src="http://7u2nvr.com1.z0.glb.clouddn.com/picouterie.jpg" border="0" height="42" width="820"
           alt="You are using an outdated browser. For a faster, safer browsing experience, upgrade for free today or use other browser ,like chrome firefox safari."
           style='margin-left:auto;margin-right:auto;display: block;'/>
    </a>
  </div>
<![endif]-->
  



  <div class="container one-column page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><h1 class="site-meta">
  <span class="logo-line-before"><i></i></span>
  <a href="/" class="brand" rel="start">
      <span class="logo">
        <i class="icon-next-logo"></i>
      </span>
      <span class="site-title">Web开发实践手札</span>
  </a>
  <span class="logo-line-after"><i></i></span>
</h1>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            <i class="menu-item-icon icon-next-home"></i> <br />
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            <i class="menu-item-icon icon-next-categories"></i> <br />
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            <i class="menu-item-icon icon-next-about"></i> <br />
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            <i class="menu-item-icon icon-next-archives"></i> <br />
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            <i class="menu-item-icon icon-next-tags"></i> <br />
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            <i class="menu-item-icon icon-next-commonweal"></i> <br />
            公益404
          </a>
        </li>
      

      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div id="content" class="content"> 

  <div id="posts" class="posts-expand">
    

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
    <header class="post-header">

      
      
        <h1 class="post-title" itemprop="name headline">
          
          
            
              2016
            
          
        </h1>
      

      <div class="post-meta">
        <span class="post-time">
          发表于
          <time itemprop="dateCreated" datetime="2016-12-31T23:09:12+08:00" content="2016-12-31">
            2016-12-31
          </time>
        </span>

        
          <span class="post-category" >
            &nbsp; | &nbsp; 分类于
            
              <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                <a href="/categories/生活/" itemprop="url" rel="index">
                  <span itemprop="name">生活</span>
                </a>
              </span>

              
              

            
          </span>
        

        
          
            <span class="post-comments-count">
              &nbsp; | &nbsp;
              <a href="/2016/12/31/2016/#comments" itemprop="discussionUrl">
                <span class="post-comments-count ds-thread-count" data-thread-key="2016/12/31/2016/" itemprop="commentsCount"></span>
              </a>
            </span>
          
        
      </div>
    </header>

    <div class="post-body">

      
      

      
        <span itemprop="articleBody"><h2 id="u5DE5_u4F5C"><a href="#u5DE5_u4F5C" class="headerlink" title="&#x5DE5;&#x4F5C;"></a>&#x5DE5;&#x4F5C;</h2><h3 id="u62E9_u6728_u800C_u6816"><a href="#u62E9_u6728_u800C_u6816" class="headerlink" title="&#x62E9;&#x6728;&#x800C;&#x6816;"></a>&#x62E9;&#x6728;&#x800C;&#x6816;</h3><ul>
<li>2016-03-28&#x5165;&#x804C;&#x94FE;&#x5BB6;&#x7F51;&#xFF0C;&#x4E4B;&#x524D;&#x7EA6;1&#x5E74;&#x65F6;&#x95F4;&#x5728;&#x661F;&#x56FE;&#x6570;&#x636E;&#x505A;&#x4EA7;&#x54C1;&#x7814;&#x53D1;&#xFF0C;&#x4EE3;&#x7801;&#x8D8A;&#x5199;&#x8D8A;lonely&#xFF0C;&#x56E0;&#x4E3A;web&#x4EA7;&#x54C1;&#x7814;&#x53D1;&#x5C31;&#x5269;&#x6211;&#x4E00;&#x4E2A;&#x3002;&#x53D7;&#x76AE;&#x5C11;&#x4ED6;&#x4EEC;&#x9F13;&#x52B1;&#x52C7;&#x6562;&#x6EF4;&#x5C06;&#x7B80;&#x5386;&#x53D1;&#x5230;&#x4E86;&#x6BC5;&#x54E5;&#x90AE;&#x7BB1;&#xFF0C;&#x518D;&#x540E;&#x6765;&#x7ECF;&#x5386;&#x201C;&#x4E94;&#x5C0F;&#x65F6;&#x9762;&#x8BD5;&#x201D;&#x3001;&#x4E50;&#x89C6;offer&#x53D1;&#x653E;delay&#x3001;&#x62D2;&#x7EDD;&#x9E4F;&#x535A;&#x58EB;&#x7B49;&#x4E8B;&#x60C5;&#xFF0C;&#x8FDB;&#x5165;&#x5E73;&#x53F0;&#x7EC4;&#x3002;</li>
<li>&#x65B0;&#x56E2;&#x961F;&#x5185;&#x5927;&#x5BB6;&#x90FD;&#x5F88;&#x4F18;&#x79C0;&#x4E14;&#x610F;&#x6C14;&#x76F8;&#x6295;&#x3001;&#x6C1B;&#x56F4;&#x60EC;&#x610F;&#xFF0C;&#x987A;&#x7406;&#x6210;&#x7AE0;&#x4E4E;&#x6211;&#x5F88;&#x52AA;&#x529B;&#xFF0C;&#x7279;&#x522B;&#x73CD;&#x60DC;&#x65B0;&#x5DE5;&#x4F5C;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x964D;&#x85AA;&#x800C;&#x6765;&#x3002;&#x611F;&#x8C22;&#x7EC4;&#x91CC;&#x8001;&#x53F8;&#x673A;&#xFF5E; &#x771F;&#x7684;&#xFF01;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF0C;&#x8FD8;&#x6709;&#x4ED6;&#x4EEC;&#x7684;&#x8C26;&#x900A;&#x3001;&#x8BA4;&#x771F;&#x3001;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x8BA9;&#x6211;&#x53D7;&#x76CA;&#x532A;&#x6D45;</li>
<li>&#x6162;&#x6162;&#x6311;&#x8D77;&#x8BDD;&#x52A1;&#x5E73;&#x53F0;&#x5E76;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x867D;&#x7136;&#x8981;&#x4EA4;&#x63A5;&#x7ED9;&#x4ED6;&#x4EBA;&#x3002;&#x4F46;&#x662F;tp&#x662F;&#x5BFC;&#x5E08;&#x4EEC;&#x7684;&#x5FC3;&#x8840;&#xFF0C;&#x6211;&#x6709;&#x8D23;&#x4EFB;&#x548C;&#x4E49;&#x52A1;&#x628A;&#x5979;&#x7167;&#x987E;&#x597D;&#xFF0C;Thanks God! &#x6211;&#x505A;&#x5230;&#x4E86;</li>
</ul>
<h3 id="u6539_u671D_u6362_u4EE3"><a href="#u6539_u671D_u6362_u4EE3" class="headerlink" title="&#x6539;&#x671D;&#x6362;&#x4EE3;"></a>&#x6539;&#x671D;&#x6362;&#x4EE3;</h3><ul>
<li>&#x516C;&#x53F8;&#x4E2D;&#x9AD8;&#x5C42;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x8C03;&#x6574;&#xFF0C;platrd&#x6210;&#x4E3A;&#x5386;&#x53F2;&#xFF0C;pangee&#x548C;monika&#x53BB;&#x4E86;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x5165;&#x65B0;&#x90E8;&#x95E8;Inf&#xFF0C;&#x600E;&#x4E48;&#x8BB2;&#x5462;&#xFF1F;&#x201C;&#x5148;&#x5E1D;&#x521B;&#x4E1A;&#x672A;&#x534A;&#x800C;&#x4E2D;&#x9053;&#x5D29;&#x6B82;&#x201C; &#x89C4;&#x5212;&#x4E86;&#x534A;&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#x968F;&#x98CE;&#x800C;&#x53BB;&#xFF0C;&#x61A7;&#x61AC;&#x7684;&#x573A;&#x666F;&#x70DF;&#x6D88;&#x4E91;&#x6563;&#x3002;&#x201C;&#x5F80;&#x4E8B;&#x4E0D;&#x8981;&#x518D;&#x63D0; &#x4EBA;&#x751F;&#x5DF2;&#x591A;&#x98CE;&#x96E8;&#x201D; &#x53EA;&#x662F;&#x89C9;&#x5F97;&#x5751;&#x4E86;&#x5C0F;&#x76AE;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FDE;&#x8499;&#x5E26;&#x9A97;&#x628A;&#x4ED6;&#x9080;&#x6765;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#x662F;&#x6211;..</li>
<li>&#x540E;&#x534A;&#x5E74;&#x6BD4;&#x8F83;&#x5355;&#x8C03;&#xFF0C;&#x8BDD;&#x52A1;&#x3001;TP&#x3001;&#x8BDD;&#x52A1;&#x3001;TP&#x2026; &#x65E0;&#x4ED6;&#xFF5E; &#x5176;&#x5B9E;&#x6280;&#x672F;&#x6311;&#x6218;&#x4E0D;&#x662F;&#x5F88;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x6781;&#x8003;&#x9A8C;&#x4EBA;&#x7684;&#x8010;&#x6027;&#x548C;&#x97E7;&#x6027;&#x3002;</li>
<li>&#x9E1F;&#x54E5;&#x4ECE;&#x4E09;&#x4E9A;&#x56DE;&#x6765;&#x540E;&#x51B3;&#x5B9A;&#x201C;TP&#x5E76;&#x5165;CC&#x201D;&#xFF0C;&#x5948;&#x4F55;&#x9119;&#x4EBA;&#x662F;&#x4E2A;&#x201C;&#x70C8;&#x6027;&#x5B50;&#x201D;&#xFF0C;&#x4E8E;&#x662F;&#x4E4E;&#xFF1A;&#x4EBA;&#x4E0D;&#x52A8;&#xFF0C;&#x9879;&#x76EE;&#x4EA4;&#x51FA;&#x53BB;&#xFF0C;&#x4E00;&#x79CD;&#x201C;&#x517B;&#x4E86;&#x5341;&#x516B;&#x5E74;&#x7684;&#x767D;&#x83DC;&#x8981;&#x88AB;&#x2026;.&#x201D;&#x7684;&#x611F;&#x89C9;&#x3002;&#x989D;&#xFF0C;&#x8FD9;&#x6837;&#x8BF4;&#x4E0D;&#x592A;&#x59A5;&#x3002;&#x4E0D;&#x8FC7;&#x4EE4;&#x4EBA;&#x5D29;&#x6E83;&#x7684;&#x8FD8;&#x5728;&#x540E;&#x9762;&#xFF0C;&#x201C;&#x5E74;&#x5E95;&#x4E0D;&#x597D;&#x62DB;&#x4EBA;&#x201D;&#x3001;&#x201C;&#x4EBA;&#x5230;&#x4F4D;&#x624D;&#x5F00;&#x59CB;&#x4EA4;&#x63A5;&#x201D;&#x3001;&#x201C;&#x4EA4;&#x63A5;&#x5468;&#x671F;6&#x4E2A;&#x6708;&#x201D;&#x2026; &#x53EF;&#x662F;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4EBA;&#x751F;&#x90A3;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x516D;&#x4E2A;&#x6708; &#x1F633;</li>
</ul>
<h3 id="u83AB_u6101_u524D_u8DEF"><a href="#u83AB_u6101_u524D_u8DEF" class="headerlink" title="&#x83AB;&#x6101;&#x524D;&#x8DEF;"></a>&#x83AB;&#x6101;&#x524D;&#x8DEF;</h3><ul>
<li>&#x5176;&#x5B9E;&#x4E0A;&#x5B66;&#x90A3;&#x4F1A;&#x513F;&#x662F;&#x7ACB;&#x5FD7;&#x5F53;&#x4E2A;&#x8FD0;&#x7EF4;&#x7684;&#xFF0C;&#x68A6;&#x60F3;&#x201C;&#x53BB;&#x5FAE;&#x8F6F;&#x7BA1;&#x7406;&#x767E;&#x4E07;&#x670D;&#x52A1;&#x5668;&#x201D;&#xFF0C;&#x673A;&#x7F18;&#x5DE7;&#x5408;&#x5730;&#xFF0C;&#x5199;&#x4E86;&#x4EE3;&#x7801;&#xFF0C;&#x4E14;&#x53D1;&#x73B0;&#x8FD8;&#x86EE;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x5929;virtual box&#x6216;&#x8005;firfox&#x662F;&#x6211;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x592B;&#x590D;&#x4F55;&#x6C42;&#xFF1F;</li>
<li>&#x672C;&#x6765;&#x5728;TP release V1&#x4E4B;&#x540E;&#xFF0C;&#x4E5F;&#x5C31;&#x8BE5;&#x8003;&#x8651;&#x65B0;&#x6311;&#x6218;&#x4E86;&#xFF0C;js&#x4E5F;&#x597D;go&#x4E5F;&#x7F62;&#xFF0C;&#x60F3;&#x6765;&#x4E00;&#x5B9A;&#x4F1A;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x3002;</li>
<li>&#x57FA;&#x7840;&#x670D;&#x52A1;&#x4E0D;&#x540C;&#x4E8E;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x6311;&#x6218;&#x66F4;&#x9AD8;&#xFF0C;&#x6280;&#x672F;&#x548C;&#x601D;&#x7EF4;&#x66F4;&#x9700;&#x5168;&#x9762;&#x3001;&#x6DF1;&#x523B;&#x3001;&#x7F1C;&#x5BC6;&#x3002; new year!new team&#x3001;new leader&#x3001;new partners&#x3001;new goals&#x3001;new challenge&#x3001;new achievement&#xFF01;</li>
</ul>
<h2 id="u751F_u6D3B"><a href="#u751F_u6D3B" class="headerlink" title="&#x751F;&#x6D3B;"></a>&#x751F;&#x6D3B;</h2><p>&#x751F;&#x6D3B;&#x6BD4;&#x8F83;&#x7B80;&#x5355;</p>
<ul>
<li>&#x4F9D;&#x65E7;&#x70ED;&#x7231;&#x7740;&#x7BEE;&#x7403;&#xFF0C;&#x4ECE;&#x7403;&#x98CE;&#x6765;&#x8BF4;&#xFF0C;&#x63A7;&#x7403;&#x548C;&#x7A81;&#x7834;&#x6709;&#x5927;&#x957F;&#x8FDB;&#xFF0C;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x5E0C;&#x671B;&#x80FD;&#x679C;&#x65AD;&#x70B9;&#xFF0C;&#x591A;&#x4E9B;&#x51FA;&#x624B;&#x3002;16&#x5E74;&#x5927;&#x5C0F;&#x4F24;&#x597D;&#x591A;&#x6B21;&#xFF0C;&#x624B;&#x6307;&#x3001;&#x811A;&#x8E1D;&#x3001;&#x819D;&#x76D6;&#xFF0C;&#x4F60;&#x4EEC;&#x53D7;&#x82E6;&#x4E86;&#xFF5E;&#x3002;&#x6709;&#x4E00;&#x6B21;&#x665A;&#x4E0A;&#x6CA1;&#x5E26;&#x624B;&#x673A;&#x53BB;&#x5317;&#x5927;&#x533B;&#x5B66;&#x9662;&#x6253;&#x7403;&#xFF0C;&#x7ED3;&#x679C;&#x5D34;&#x4E86;&#x811A;&#xFF0C;&#x6CA1;&#x529E;&#x6CD5;&#x53EA;&#x80FD;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5FCD;&#x7740;&#x75DB;&#x632A;&#x56DE;&#x53BB;&#xFF0C;&#x5F53;&#x65F6;&#x987F;&#x89C9;&#x51C4;&#x51C9;&#xFF0C;&#x4E00;&#x4EBA;&#x5317;&#x4EAC;&#x6F02;&#xFF0C;&#x6302;&#x6389;&#x65E0;&#x4EBA;&#x77E5;&#x3002;</li>
<li>NBA&#x6BD4;&#x8D5B;&#x4F9D;&#x65E7;&#x7EE7;&#x7EED;&#xFF0C;&#x9A91;&#x58EB;&#x590F;&#x5929;&#x593A;&#x4E86;&#x51A0;&#xFF0C;&#x65B0;&#x8D5B;&#x5B63;&#x675C;&#x5170;&#x7279;&#x53BB;&#x4E86;&#x52C7;&#x58EB;&#xFF0C;&#x5A01;&#x65AF;&#x5E03;&#x9C81;&#x514B;&#x5355;&#x6838;&#x5E26;&#x961F;&#x98CE;&#x751F;&#x6C34;&#x8D77;&#xFF0C;&#x6614;&#x65E5;&#x4E09;&#x5C11;&#x54C8;&#x767B;&#x548C;&#x90A3;&#x5E2E;&#x677F;&#x51F3;&#x532A;&#x5F92;&#x8FDB;&#x653B;&#x6108;&#x53D1;&#x7280;&#x5229;&#x3002;&#x9093;&#x80AF;&#x9000;&#x5F79;&#x4E86;&#xFF0C;&#x6CE2;&#x6CE2;&#x767D;&#x53D1;&#x4EBA;&#x201C;&#x9001;&#x201D;&#x9ED1;&#x53D1;&#x4EBA;&#xFF0C;&#x72D7;&#x523A;&#x5374;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x7A33;&#xFF01;&#x5FC3;&#x4E2D;&#x7275;&#x6302;&#x7684;&#x5FEB;&#x8239;&#x5728;&#x6253;&#x51FA;&#x6700;&#x4F73;&#x5F00;&#x5C40;&#x540E;&#x6700;&#x8FD1;&#x9677;&#x5165;5&#x8FDE;&#x8D25;&#xFF0C;&#x7279;&#x522B;&#x3001;&#x7279;&#x522B;&#x5E0C;&#x671B;&#x4FDD;&#x7F57;&#x80FD;&#x8FDB;&#x897F;&#x51B3;&#xFF0C;&#x795D;&#x597D;&#xFF5E;</li>
<li>&#x57F9;&#x517B;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7231;&#x597D;&#x2013;&#x201C;&#x53F0;&#x7403;&#x201D;&#xFF0C;&#x611F;&#x8C22;&#x516C;&#x53F8;&#x63D0;&#x4F9B;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x7403;&#x90FD;&#x5F00;&#x4E0D;&#x597D;&#x7684;&#x5C0F;&#x767D;&#x5230;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4E09;&#x6746;&#x6E05;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x611F;&#x6168;&#x4E00;&#x756A;&#xFF0C;&#x201C;&#x53EA;&#x8981;&#x80AF;&#x5B66;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x89C2;&#x5BDF;&#x6A21;&#x4EFF;&#x522B;&#x4EBA;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x7422;&#x78E8;&#xFF0C;&#x518D;&#x8F85;&#x4EE5;&#x52E4;&#x594B;&#x7684;&#x7EC3;&#x4E60;&#xFF0C;&#x90A3;&#x4E48;&#x4E07;&#x4E8B;&#x90FD;&#x4F1A;&#x6709;&#x6240;&#x56DE;&#x62A5;&#xFF0C;&#x6709;&#x6240;&#x957F;&#x8FDB;&#x201D;</li>
<li>2016&#x5E74;&#x8FFD;&#x8FC7;&#x4E00;&#x4F4D;&#x59D1;&#x5A18;&#xFF0C;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x7F18;&#x5206;&#x672A;&#x5230;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#x4E0D;&#x5F53;&#x3002;2017&#xFF0C;&#x7EE7;&#x7EED;&#x671F;&#x76FC;&#x7EE7;&#x7EED;&#x7B49;&#x5F85;&#x7F18;&#x5206;&#x6765;&#x4E34;&#x3002;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x5207;&#x7F8E;&#x597D;&#x73CD;&#x85CF;&#x4E8E;&#x5FC3;&#x5E95;&#xFF0C;&#x4E00;&#x5207;&#x60B2;&#x6851;&#x5C31;&#x7559;&#x5728;2016&#x5427;. </li>
<li>&#x5E74;&#x5E95;&#x5F00;&#x59CB;&#x4F7F;&#x7528;keep&#x505A;&#x4E9B;&#x5BA4;&#x5185;&#x953B;&#x70BC;&#xFF0C;&#x6BD5;&#x7ADF;&#x5916;&#x9762;&#x96FE;&#x973E;&#x592A;&#x91CD;&#x4E86;&#x3002;&#x201C;&#x575A;&#x6301; &#x575A;&#x6301; &#x518D;&#x575A;&#x6301;&#x201D; &#x76F8;&#x4FE1;&#x80FD;&#x89C1;&#x5230;&#x6548;&#x679C;&#xFF0C;&#x60F3;&#x8D77;&#x4E00;&#x53E5;&#x8BDD;&#x201C;&#x4E00;&#x4E2A;&#x4EBA;&#x8FDE;&#x81EA;&#x5DF1;&#x7684;&#x4F53;&#x91CD;&#x90FD;&#x63A7;&#x5236;&#x4E0D;&#x4E86;&#xFF0C;&#x8C08;&#x4F55;&#x638C;&#x63A7;&#x4EBA;&#x751F;&#x201C; </li>
<li>16&#x5E74;&#x6362;&#x4E86;&#x624B;&#x673A;&#xFF0C;&#x65B0;&#x7248;&#x4F4E;&#x914D;iPhone&#xFF0C;&#x53C8;&#x7528;&#x4E0A;&#x4E86;&#x6700;&#x5177;&#x60C5;&#x6000;&#x7684;&#x952E;&#x76D8;HHKB&#xFF0C;&#x867D;&#x7136;&#x662F;&#x4E8C;&#x624B;&#x7684;&#x3002;&#x81F3;&#x6B64;&#xFF0C;rMBP&#x3001;iPhone&#x3001;HHKB&#x3001;Kindle&#x3001;iPad&#x90FD;&#x6709;&#x4E86;&#xFF0C;&#x5C31;&#x5DEE;&#x5199;&#x51FA;&#x6F02;&#x4EAE;&#x7684;&#x4EE3;&#x7801;&#x4E86;&#x3002;</li>
<li>&#x4E09;&#x59D0;&#x5BB6;&#x5C0F;&#x5916;&#x7525;&#x5973;&#x51FA;&#x751F;&#x3001;&#x4E8C;&#x59D0;&#x5BB6;&#x5916;&#x7525;&#x8301;&#x58EE;&#x6210;&#x957F;&#x3001;&#x5927;&#x59D0;&#x6000;&#x4E86;baby&#x3001;&#x6BCD;&#x540E;&#x624B;&#x672F;&#x987A;&#x5229;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E0A;&#x5929;&#x7684;&#x7737;&#x987E;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x6700;&#x5927;&#x5FC3;&#x613F;&#xFF0C;&#x201C;&#x5BB6;&#x4EBA;&#x5065;&#x5065;&#x5EB7;&#x5EB7;&#x3001;&#x5FEB;&#x5FEB;&#x4E50;&#x4E50;&#x201D;</li>
<li>&#x4ECA;&#x5E74;&#x7EC8;&#x4E8E;&#x51FA;&#x4E86;&#x8D9F;&#x8FDC;&#x95E8;&#xFF0C;&#x53BB;&#x4E86;&#x6B21;&#x676D;&#x5DDE;&#xFF0C;&#x4EBA;&#x751F;&#x8D70;&#x8FC7;&#x6700;&#x5357;&#x3001;&#x6700;&#x8FDC;&#x7684;&#x5730;&#x65B9;&#x4E86;&#x3002;17&#x5E74;&#xFF0C;&#x53BB;&#x611F;&#x53D7;&#x66F4;&#x591A;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x54C8;&#x5C14;&#x6EE8;&#x3001;&#x4E0A;&#x6D77;&#x3001;&#x6210;&#x90FD;&#x3001;&#x6DF1;&#x5733;&#x3001;&#x897F;&#x85CF;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x4E2A;&#x59D1;&#x5A18;&#x4E00;&#x8D77;&#x662F;&#x6700;&#x597D;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x7684;&#x8BDD;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x4EBA;&#x4E5F;&#x8981;&#x7CBE;&#x5F69;</li>
</ul>
<p>&#x5317;&#x4EAC;&#x4ECA;&#x51AC;&#x96FE;&#x973E;&#x633A;&#x4E25;&#x91CD;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x8003;&#x8651;&#x6362;&#x4E2A;&#x57CE;&#x5E02;&#x751F;&#x6D3B;&#x3002;&#x9644;&#x4E0A;16 gitlab&#x65E5;&#x5386;&#x56FE;&#x4E00;&#x5F20;&#x3002;<img src="/2016/12/31/2016/images/2016gitlab.png" alt="gitlab"></p>
</span>
      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-prev post-nav-item">
            
          </div>

          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/25/react/" rel="next">react学习</a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>

 </div>

        

        
          <div class="comments" id="comments">
            
              <div class="ds-thread" data-thread-key="2016/12/31/2016/"
                   data-title="2016" data-url="http://rambone.me/2016/12/31/2016/">
              </div>
            
          </div>
        
      </div>

      
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" src="https://avatars1.githubusercontent.com/u/4715122?v=3&s=460" alt="Rambo" itemprop="image"/>
          <p class="site-author-name" itemprop="name">Rambo</p>
        </div>
        <p class="site-description motion-element" itemprop="description">工作以来的尝试和感想</p>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">23</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          <div class="site-state-item site-state-categories">
            <a href="/categories">
              <span class="site-state-item-count">5</span>
              <span class="site-state-item-name">分类</span>
              </a>
          </div>

          <div class="site-state-item site-state-tags">
            <a href="/tags">
              <span class="site-state-item-count">19</span>
              <span class="site-state-item-name">标签</span>
              </a>
          </div>

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/zuoRambo" target="_blank">github</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/rambone" target="_blank">微博</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://douban.com/people/Rambone" target="_blank">豆瓣</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/Rambone" target="_blank">知乎</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://about.me/rambone" target="_blank">aboutme</a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">友情链接</p>
            
              <span class="links-of-author-item">
              <a href="http://macshuo.com/" target="_blank">MacTalk</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator"></div>
          <div class="post-toc">
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#u5DE5_u4F5C"><span class="nav-number">1.</span> <span class="nav-text">工作</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#u62E9_u6728_u800C_u6816"><span class="nav-number">1.1.</span> <span class="nav-text">择木而栖</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#u6539_u671D_u6362_u4EE3"><span class="nav-number">1.2.</span> <span class="nav-text">改朝换代</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#u83AB_u6101_u524D_u8DEF"><span class="nav-number">1.3.</span> <span class="nav-text">莫愁前路</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#u751F_u6D3B"><span class="nav-number">2.</span> <span class="nav-text">生活</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator"></div>
        </section>
      

    </div>
  </aside>


    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner"> <div class="copyright" >
  
  &copy; &nbsp;  2015 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="icon-next-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Rambo</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


 </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  
  
    

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"rambone"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>
    
     
  	  <script type="text/javascript">
  		var duoshuo_user_ID = 2028992
  	  </script>
     
  	<script src="/js/ua-parser.min.js"></script>
  	<script src="/js/hook-duoshuo.js"></script>
  

    
  
  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>
  <script type="text/javascript" src="/js/fancy-box.js?v=0.4.5.1"></script>


  <script type="text/javascript" src="/js/helpers.js?v=0.4.5.1"></script>
  

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/js/motion_global.js?v=0.4.5.1" id="motion.global"></script>




  <script type="text/javascript" src="/js/nav-toggle.js?v=0.4.5.1"></script>
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  
<script type="text/javascript" src="/js/bootstrap.scrollspy.js?v=0.4.5.1" id="bootstrap.scrollspy.custom"></script>


<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 0.4 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    var $tocContent = $('.post-toc-content');
    if (isDesktop() && CONFIG.sidebar === 'post') {
      if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
        displaySidebar();
      }
    }
  });
</script>



  <script type="text/javascript">
    $(document).ready(function () {
      if (CONFIG.sidebar === 'always') {
        displaySidebar();
      }
      if (isMobile()) {
        FastClick.attach(document.body);
      }
    });
  </script>

  
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
      processEscapes: true,
      skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
    }
  });
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for (i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  
  

  
  <script type="text/javascript" src="/js/lazyload.js"></script>
  <script type="text/javascript">
    $(function () {
      $("#posts").find('img').lazyload({
        placeholder: "/images/loading.gif",
        effect: "fadeIn"
      });
    });
  </script>
</body>
</html>
